# LinesOverlapPath3d Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..LinesOverlapPath3d Property
BuiltInFailures..::..SketchFailures Class See Also
---
Cannot have overlapping lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LinesOverlapPath3d { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LinesOverlapPath3d As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LinesOverlapPath3d {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace